In [2]:
import pandas as pd

In [3]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [4]:
#1.top 3 Rows

In [5]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [6]:
#2.last 3 Rows

In [7]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [8]:
#3.Shape of Dataset

In [9]:
df1.shape

(7, 3)

In [10]:
print('Number of Rows',df1.shape[0])
print('Number of Columns',df1.shape[1])

Number of Rows 7
Number of Columns 3

In [11]:
#4.Get imformaion about dataset

In [12]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [13]:
#5.check Null Values

In [20]:
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

In [21]:
#6.get over all statistics

In [23]:
df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [24]:
#7.find Unique Values From the genger Column

In [29]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [30]:
#8.find the number of Unique values

In [31]:
df1['Gender'].nunique()

2

In [32]:
#9.Count of Unique Values

In [33]:
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

In [34]:
#10.find total number of students marks between  90 to 100

In [35]:
df1[df1['Marks'] >=90 ]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [43]:
len(df1[(df1['Marks'] >=90)  & (df1['Marks'] <=100 )])

4

In [46]:
sum(df1['Marks'].between(90,100))

4

In [47]:
#11.Find Average Marks

In [48]:
df1['Marks'].mean()

92.14285714285714

In [49]:
#12.Apply Method

In [50]:
def marks(x):
    return x/2

In [52]:
df1['Marks'].apply(marks)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [53]:
df1['Half_Marks'] =df1['Marks'].apply(marks)

In [54]:
df1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [56]:
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [57]:
#apply 與 lambda 指令可以用來自訂義函式

In [59]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [60]:
# 13.map Function

In [62]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})

In [63]:
df1

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1
5   Mittal     83  Female        41.5            0
6  Archana     99  Female        49.5            0

In [64]:
# 14.Drop

In [65]:
df1

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1
5   Mittal     83  Female        41.5            0
6  Archana     99  Female        49.5            0

In [66]:
df1.drop('Male_Female',axis=1)

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [68]:
df1.drop(['Male_Female','Half_Marks'],axis=1,inplace=True)

In [69]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [70]:
#15.print the Columns

In [71]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [74]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [75]:
#16.sort the dataframe

In [80]:
df1.sort_values(by = ['Marks','Gender'],ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [81]:
#16.display name & marks the female students

In [82]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [86]:
df1[df1['Gender'] == 'Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99